tiborsimon/embedded-tdd-headers/pic/pic18/pic18f64j11_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F64J11_H_
#define _PIC18F64J11_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define ADDEN2                        9
#define RCSTA2_ADDEN                  10
#define RCSTA2_CREN                   11
#define CREN2                         12
#define SREN2                         13
#define RCSTA2_SREN                   14
#define RC92                          15
#define RCSTA2_nRC8                   16
#define RC8_92                        17
#define RCSTA2_RX9                    18
#define RCSTA2_NOT_RC8                19
#define RCSTA2_RC9                    20
#define RCSTA2_RC8_9                  21
#define RX92                          22
#define RCSTA2_SPEN                   23
#define SPEN2                         24
#define TXSTA2                        25
#define TXSTA2_TXD8                   26
#define TX9D2                         27
#define TXSTA2_TX9D                   28
#define TXD82                         29
#define TRMT2                         30
#define TXSTA2_TRMT                   31
#define BRGH2                         32
#define TXSTA2_BRGH                   33
#define SENDB2                        34
#define TXSTA2_SYNC                   35
#define SYNC2                         36
#define TXEN2                         37
#define TXSTA2_TXEN                   38
#define TX8_92                        39
#define TX92                          40
#define TXSTA2_TX9                    41
#define TXSTA2_nTX8                   42
#define TXSTA2_NOT_TX8                43
#define TXSTA2_TX8_9                  44
#define TXSTA2_CSRC                   45
#define CSRC2                         46
#define CCP2CON                       47
#define CCP2M                         48
#define CCP2M0                        49
#define CCP2M1                        50
#define CCP2M2                        51
#define CCP2M3                        52
#define DC2B0                         53
#define DCCP2Y                        54
#define DC2B                          55
#define DC2B1                         56
#define DCCP2X                        57
#define CCP1CON                       58
#define CCP1M0                        59
#define CCP1M                         60
#define CCP1M1                        61
#define CCP1M2                        62
#define CCP1M3                        63
#define DCCP1Y                        64
#define DC1B                          65
#define DC1B0                         66
#define DCCP1X                        67
#define DC1B1                         68
#define BAUDCON1                      69
#define ABDEN                         70
#define ABDEN1                        71
#define WUE1                          72
#define WUE                           73
#define BRG16                         74
#define BRG161                        75
#define TXCKP                         76
#define SCKP                          77
#define TXCKP1                        78
#define SCKP1                         79
#define CKTXP                         80
#define DTRXP1                        81
#define RXDTP1                        82
#define RXDTP                         83
#define DTRXP                         84
#define RCIDL1                        85
#define RCMT                          86
#define RCMT1                         87
#define RCIDL                         88
#define ABDOVF                        89
#define ABDOVF1                       90
#define PORTA                         91
#define AN0                           92
#define ULPWUIN                       93
#define PORTA_RA0                     94
#define AN1                           95
#define PORTA_RA1                     96
#define AN2                           97
#define PORTA_RA2                     98
#define VREFM                         99
#define AN3                           100
#define PORTA_RA3                     101
#define VREFP                         102
#define PORTA_RA4                     103
#define T0CKI                         104
#define AN4                           105
#define PORTA_RA5                     106
#define LVDIN                         107
#define CLKO                          108
#define PORTA_RA6                     109
#define OSC2                          110
#define CLKI                          111
#define PORTA_RA7                     112
#define OSC1                          113
#define RJPU                          114
#define PORTB                         115
#define INT0                          116
#define PORTB_RB0                     117
#define INT1                          118
#define PORTB_RB1                     119
#define INT2                          120
#define PORTB_RB2                     121
#define INT3                          122
#define CCP2_PA2                      123
#define PORTB_CCP2                    124
#define PORTB_RB3                     125
#define KBI0                          126
#define PORTB_RB4                     127
#define KBI1                          128
#define PORTB_RB5                     129
#define PGC                           130
#define KBI2                          131
#define PORTB_RB6                     132
#define PGD                           133
#define KBI3                          134
#define PORTB_RB7                     135
#define PORTC                         136
#define T13CKI                        137
#define T1OSO                         138
#define PORTC_RC0                     139
#define PORTC_CCP2                    140
#define T1OSI                         141
#define PORTC_RC1                     142
#define PA2                           143
#define CCP1                          144
#define PA1                           145
#define PORTC_RC2                     146
#define SCL                           147
#define SCK                           148
#define PORTC_RC3                     149
#define SDA                           150
#define SDI                           151
#define PORTC_RC4                     152
#define SDO                           153
#define PORTC_RC5                     154
#define PORTC_RC6                     155
#define TX1                           156
#define CK1                           157
#define RX1                           158
#define DT1                           159
#define PORTC_RC7                     160
#define PORTD                         161
#define PORTD_RD0                     162
#define PSP0                          163
#define PORTD_RD1                     164
#define PSP1                          165
#define PORTD_RD2                     166
#define PSP2                          167
#define PORTD_RD3                     168
#define PSP3                          169
#define PORTD_RD4                     170
#define PSP4                          171
#define PORTD_RD5                     172
#define PSP5                          173
#define PORTD_RD6                     174
#define PSP6                          175
#define PORTD_RD7                     176
#define SS2                           177
#define PSP7                          178
#define PORTE                         179
#define PD2                           180
#define RD                            181
#define RDE                           182
#define PORTE_RE0                     183
#define PORTE_WR                      184
#define WRE                           185
#define PORTE_RE1                     186
#define PC2                           187
#define CCP10                         188
#define PB2                           189
#define CS                            190
#define PORTE_RE2                     191
#define CCP9E                         192
#define PORTE_RE3                     193
#define PC3E                          194
#define PORTE_RE4                     195
#define PB3E                          196
#define CCP8E                         197
#define CCP7E                         198
#define PORTE_RE5                     199
#define PC1E                          200
#define CCP6E                         201
#define PORTE_RE6                     202
#define PB1E                          203
#define PORTE_CCP2                    204
#define CCP2E                         205
#define PORTE_RE7                     206
#define PA2E                          207
#define PORTF                         208
#define PORTF_RF1                     209
#define C2OUTF                        210
#define AN6                           211
#define PORTF_C2OUT                   212
#define AN7                           213
#define C1OUTF                        214
#define PORTF_C1OUT                   215
#define PORTF_RF2                     216
#define PORTF_RF3                     217
#define AN8                           218
#define C2INB                         219
#define PORTF_RF4                     220
#define AN9                           221
#define C2INA                         222
#define C1INB                         223
#define PORTF_RF5                     224
#define CVREF                         225
#define AN10                          226
#define C1INA                         227
#define PORTF_RF6                     228
#define AN11                          229
#define PORTF_RF7                     230
#define SS1                           231
#define AN5                           232
#define PORTG                         233
#define PORTG_RG0                     234
#define C3OUTG                        235
#define PORTG_RG1                     236
#define CK2                           237
#define TX2                           238
#define DT2                           239
#define RX2                           240
#define PORTG_RG2                     241
#define PORTG_RG3                     242
#define PORTG_RG4                     243
#define RG6                           244
#define REPU                          245
#define RG7                           246
#define RDPU                          247
#define LATA                          248
#define LATA0                         249
#define LA0                           250
#define LATA1                         251
#define LA1                           252
#define LATA2                         253
#define LA2                           254
#define LATA3                         255
#define LA3                           256
#define LATA4                         257
#define LA4                           258
#define LATA5                         259
#define LA5                           260
#define LATA6                         261
#define LA6                           262
#define LATA7                         263
#define LA7                           264
#define LATB                          265
#define LB0                           266
#define LATB0                         267
#define LB1                           268
#define LATB1                         269
#define LB2                           270
#define LATB2                         271
#define LB3                           272
#define LATB3                         273
#define LB4                           274
#define LATB4                         275
#define LB5                           276
#define LATB5                         277
#define LB6                           278
#define LATB6                         279
#define LB7                           280
#define LATB7                         281
#define LATC                          282
#define LATC0                         283
#define LC0                           284
#define LATC1                         285
#define LC1                           286
#define LATC2                         287
#define LC2                           288
#define LATC3                         289
#define LC3                           290
#define LATC4                         291
#define LC4                           292
#define LATC5                         293
#define LC5                           294
#define LATC6                         295
#define LC6                           296
#define LATC7                         297
#define LC7                           298
#define LATD                          299
#define LATD0                         300
#define LD0                           301
#define LATD1                         302
#define LD1                           303
#define LATD2                         304
#define LD2                           305
#define LATD3                         306
#define LD3                           307
#define LATD4                         308
#define LD4                           309
#define LATD5                         310
#define LD5                           311
#define LATD6                         312
#define LD6                           313
#define LATD7                         314
#define LD7                           315
#define LATE                          316
#define LATE0                         317
#define LE0                           318
#define LATE1                         319
#define LE1                           320
#define LATE2                         321
#define LE2                           322
#define LATE3                         323
#define LE3                           324
#define LATE4                         325
#define LE4                           326
#define LATE5                         327
#define LE5                           328
#define LATE6                         329
#define LE6                           330
#define LATE7                         331
#define LE7                           332
#define LATF                          333
#define LATF1                         334
#define LF1                           335
#define LF2                           336
#define LATF2                         337
#define LF3                           338
#define LATF3                         339
#define LF4                           340
#define LATF4                         341
#define LF5                           342
#define LATF5                         343
#define LF6                           344
#define LATF6                         345
#define LF7                           346
#define LATF7                         347
#define LATG                          348
#define LATG0                         349
#define LG0                           350
#define LATG1                         351
#define LG1                           352
#define LG2                           353
#define LATG2                         354
#define LATG3                         355
#define LG3                           356
#define LATG4                         357
#define LG4                           358
#define U1OD                          359
#define U2OD                          360
#define TRISA                         361
#define TRISA0                        362
#define TRISA_RA0                     363
#define TRISA1                        364
#define TRISA_RA1                     365
#define TRISA2                        366
#define TRISA_RA2                     367
#define TRISA3                        368
#define TRISA_RA3                     369
#define TRISA_RA4                     370
#define TRISA4                        371
#define TRISA_RA5                     372
#define TRISA5                        373
#define TRISA_RA6                     374
#define TRISA6                        375
#define TRISA_RA7                     376
#define TRISA7                        377
#define TRISB                         378
#define TRISB_RB0                     379
#define TRISB0                        380
#define TRISB_RB1                     381
#define TRISB1                        382
#define TRISB_RB2                     383
#define TRISB2                        384
#define TRISB_RB3                     385
#define TRISB3                        386
#define TRISB_RB4                     387
#define TRISB4                        388
#define TRISB_RB5                     389
#define TRISB5                        390
#define TRISB_RB6                     391
#define TRISB6                        392
#define TRISB_RB7                     393
#define TRISB7                        394
#define TRISC                         395
#define TRISC0                        396
#define TRISC_RC0                     397
#define TRISC1                        398
#define TRISC_RC1                     399
#define TRISC2                        400
#define TRISC_RC2                     401
#define TRISC3                        402
#define TRISC_RC3                     403
#define TRISC4                        404
#define TRISC_RC4                     405
#define TRISC5                        406
#define TRISC_RC5                     407
#define TRISC6                        408
#define TRISC_RC6                     409
#define TRISC7                        410
#define TRISC_RC7                     411
#define TRISD                         412
#define TRISD_RD0                     413
#define TRISD0                        414
#define TRISD_RD1                     415
#define TRISD1                        416
#define TRISD_RD2                     417
#define TRISD2                        418
#define TRISD_RD3                     419
#define TRISD3                        420
#define TRISD_RD4                     421
#define TRISD4                        422
#define TRISD_RD5                     423
#define TRISD5                        424
#define TRISD_RD6                     425
#define TRISD6                        426
#define TRISD_RD7                     427
#define TRISD7                        428
#define TRISE                         429
#define TRISE_RE0                     430
#define TRISE0                        431
#define TRISE1                        432
#define TRISE_RE1                     433
#define TRISE2                        434
#define TRISE_RE2                     435
#define TRISE_RE3                     436
#define TRISE3                        437
#define TRISE4                        438
#define TRISE_RE4                     439
#define TRISE_RE5                     440
#define TRISE5                        441
#define TRISE_RE6                     442
#define TRISE6                        443
#define TRISE_RE7                     444
#define TRISE7                        445
#define TRISF                         446
#define TRISF_RF1                     447
#define TRISF1                        448
#define TRISF2                        449
#define TRISF_RF2                     450
#define TRISF_RF3                     451
#define TRISF3                        452
#define TRISF_RF4                     453
#define TRISF4                        454
#define TRISF_RF5                     455
#define TRISF5                        456
#define TRISF_RF6                     457
#define TRISF6                        458
#define TRISF7                        459
#define TRISF_RF7                     460
#define TRISG                         461
#define TRISG0                        462
#define TRISG_RG0                     463
#define TRISG1                        464
#define TRISG_RG1                     465
#define TRISG2                        466
#define TRISG_RG2                     467
#define TRISG_RG3                     468
#define TRISG3                        469
#define TRISG4                        470
#define TRISG_RG4                     471
#define CCP1OD                        472
#define CCP2OD                        473
#define SPIOD                         474
#define OSCTUNE                       475
#define TUN0                          476
#define TUN1                          477
#define TUN2                          478
#define TUN3                          479
#define TUN4                          480
#define TUN5                          481
#define PLLEN                         482
#define INTSRC                        483
#define PIE1                          484
#define TMR1IE                        485
#define TMR2IE                        486
#define SSPIE                         487
#define SSP1IE                        488
#define TXIE                          489
#define TX1IE                         490
#define RCIE                          491
#define RC1IE                         492
#define ADIE                          493
#define PSPIE                         494
#define PIR1                          495
#define TMR1IF                        496
#define TMR2IF                        497
#define SSP1IF                        498
#define SSPIF                         499
#define TXIF                          500
#define TX1IF                         501
#define RCIF                          502
#define RC1IF                         503
#define ADIF                          504
#define PSPIF                         505
#define IPR1                          506
#define TMR1IP                        507
#define TMR2IP                        508
#define SSPIP                         509
#define SSP1IP                        510
#define TX1IP                         511
#define TXIP                          512
#define RCIP                          513
#define RC1IP                         514
#define ADIP                          515
#define PSPIP                         516
#define PIE2                          517
#define TMR3IE                        518
#define LVDIE                         519
#define BCLIE                         520
#define BCL1IE                        521
